//STEP001  EXEC PGM=IEFBR14                                          
//DD1      DD DSN=BXS1.TEST.PS1,                                     
//            DISP=(MOD,CATLG,DELETE),                               
//            SPACE=(TRK,(10,100),RLSE),                             
//            DCB=(LRECL=80,RECFM=FB,BLKSIZE=800,DSORG=PS)           
